---
title: "boot-repair windows"
date: 2020-11-17
forum: Windows
---

### Post by tenedor111 on 2020-11-17
Hello, I have five partition the first one seems to be windows recovery environment, the second one have only the windows boot files for uefi, the third one is a small one of 16MB named windows reserved partition that can't be mounted in linux, and the fourth one is the full windows partition. When i use bootrec /rebuildbcd in a rescue envioroment it says that it couldn't contact the windows boot files. I did apply boot repair but it didn't solve the problems. When I start windows it appear a message that because a hardware or software change it couldn't initiate, state 0xc000000e and unspected error. The attachment is the log that windows made when you use the rescue tool and try to use the tool initial automatic reparation -I'm translating it directly from spanish- I don't know why boot info and boot repair log don't attach, so I'll copy them directly

Boot info

[HTML]https://pastebin.com/fHjLBchB[/HTML]

boot repair-log
[HTML]https://pastebin.com/hGwjbPrR[/HTML]

---

### Post by tea for one on 2020-11-17
[COLOR="#0000FF"]Line 237[/COLOR] You only have Windows installed on your PC

Boot-repair is not suitable to repair Windows boot problems.

I suggest that you try a Windows support forum.

---

### Post by QIII on 2020-11-17
Moved to Windows sub-forum.

---

### Post by oldfred on 2020-11-17
Old but may still apply:
How to Get Around Windows&#8217; &#8220;Shrink Volume&#8221; Inadequacy Problems
[http://www.howtogeek.com/howto/windows-vista/working-around-windows-vistas-shrink-volume-inadequacy-problems/](http://www.howtogeek.com/howto/windows-vista/working-around-windows-vistas-shrink-volume-inadequacy-problems/)
Hiberfile in Windows 7, 8 & 10 often prevents shrink
[http://www.sevenforums.com/tutorials/819-hibernate-enable-disable.html](http://www.sevenforums.com/tutorials/819-hibernate-enable-disable.html)

Windows has additional partitions:
BIOS & UEFI Windows partitions, note system has totally different format  & meaning between BIOS & UEFI
[https://msdn.microsoft.com/en-us/library/windows/hardware/dn898504%28v=vs.85%29.aspx](https://msdn.microsoft.com/en-us/library/windows/hardware/dn898504%28v=vs.85%29.aspx) & 
[https://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/configure-uefigpt-based-hard-drive-partitions#RecommendedPartitionConfigurations](https://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/configure-uefigpt-based-hard-drive-partitions#RecommendedPartitionConfigurations)
[https://msdn.microsoft.com/en-us/library/windows/hardware/dn898510%28v=vs.85%29.aspx#RecommendedPartitionConfigurations](https://msdn.microsoft.com/en-us/library/windows/hardware/dn898510%28v=vs.85%29.aspx#RecommendedPartitionConfigurations)

Fast Start up off (always on hibernation), note that Windows turns this back on with updates, SHIFT + Shut down button
[http://ubuntuforums.org/showthread.php?t=2324331&p=13488472#post13488472](http://ubuntuforums.org/showthread.php?t=2324331&p=13488472#post13488472)
[http://www.tenforums.com/tutorials/4189-fast-startup-turn-off-windows-10-a.html](http://www.tenforums.com/tutorials/4189-fast-startup-turn-off-windows-10-a.html)
[http://www.tenforums.com/tutorials/2859-hibernate-enable-disable-windows-10-a.html](http://www.tenforums.com/tutorials/2859-hibernate-enable-disable-windows-10-a.html)

Windows 10 repair disk
[https://askubuntu.com/questions/1156795/windows-hard-disk-read-only-now-windows-is-removed?noredirect=1#comment1925839_1156795](https://askubuntu.com/questions/1156795/windows-hard-disk-read-only-now-windows-is-removed?noredirect=1#comment1925839_1156795)
[https://www.tenforums.com/software-apps/27180-windows-10-recovery-tools-bootable-rescue-disk.html](https://www.tenforums.com/software-apps/27180-windows-10-recovery-tools-bootable-rescue-disk.html)
[http://www.tenforums.com/tutorials/4200-recovery-drive-create-windows-10-a.html](http://www.tenforums.com/tutorials/4200-recovery-drive-create-windows-10-a.html)
[http://www.tenforums.com/tutorials/36083-system-repair-disc-create-windows-10-a.html](http://www.tenforums.com/tutorials/36083-system-repair-disc-create-windows-10-a.html)
Repair/backup/restore
[https://support.microsoft.com/en-us/instantanswers/3a747883-b706-43a5-a286-9e98f886d490/create-a-recovery-drive](https://support.microsoft.com/en-us/instantanswers/3a747883-b706-43a5-a286-9e98f886d490/create-a-recovery-drive) & 
[http://windows.microsoft.com/en-us/windows-10/windows-10-recovery-options](http://windows.microsoft.com/en-us/windows-10/windows-10-recovery-options)

---

### Post by tenedor111 on 2020-11-23
ok, thank you

---

